Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/cancer_services/palliative_care.html.txt.tmx
Source language: en
Languages: ga

source: • Palliative care and children
ga: • Cúram maolaitheach agus leanaí

source: Palliative care aims to provide the best quality of life possible for a terminally ill patient and their family, including keeping the patient free from pain as far as is possible
ga: Tá sé d’aidhm ag cúram maolaitheach an cháilíocht beatha is fearr is féidir a sholáthar don duine a bhfuil tinneas foirceanta orthu agus dá dteaghlach, lena n-áirítear a chinntiú, a mhéid is féidir, go bhfuil an duine saor ó phian

source: It responds to physical, psychological, social and spiritual needs and extends to support in bereavement
ga: Freagraíonn sé do riachtanais fhisiciúla, shíceolaíocha, shóisialta agus spioradálta agus cuimsíonn sé tacaíocht do lucht méala

source: The Health Service Executive (HSE) has responsibility for providing palliative care services
ga: Is dualgas é de chuid Fheidhmeannacht na Seirbhíse Sláinte (FSS) seirbhísí cúraim mhaolaithigh a chur ar fáil

source: Whilst palliative care was originally developed primarily for cancer patients, care is also available to other patients such as those with motor neurone disease or multiple sclerosis
ga: Cé go bhfuil cúram maolaitheach dírithe den chuid is mó ar othair a bhfuil ailse orthu, bíonn othair a bhfuil galar néarón luadrach, scléaróis iolrach agus VEID orthu in ospísí freisin

source: Palliative care can be provided in a hospice, in an acute or community hospital or in the patient's home
ga: Is féidir cúram maolaitheach a sholáthar in ospís, in ospidéal pobail géarmhíochaine nó i dteach an othair

source: Access to palliative care is decided by the HSE on the basis of need
ga: Cinneann FSS cé hiad na daoine a dtabharfar rochtain ar chúram maolaitheach dóibh ar bhonn riachtanais

source: There is some variation in the availability of palliative care throughout the country
ga: Tá an fháil atá ar chúram maolaitheach éagsúil, go méid áirithe, ar fud na tíre

source: Palliative care is provided in a number of ways by specialist palliative care in-patient units (hospices)
ga: Soláthraítear cúram maolaitheach i sain-aonaid chúraim mhaolaithigh d’othair chónaitheacha (ospísí) ar roinnt bealaí

source: These units form the hub around which other services are developed
ga: Is mol iad na haonaid seo a bhforbraítear seirbhísí eile ina dtimpeall

source: Currently there are nine hospice units; three in the Dublin area and one each in counties Kildare, Limerick, Cork, Galway, Sligo and Donegal
ga: Tá naoi n-aonad ospíse ann faoi láthair, trí cinn i gceantar Bhaile Átha Cliath, agus ceann sna contaetha seo a leanas: Chill Dara, Luimneach, Corcaigh, Gaillimh, Sligeach agus Dún na nGall

source: Hospice or palliative care is provided:
ga: Soláthraítear cúram ospíse nó cúram maolaitheach:

source: • In people’s own homes, by home-care nurses working in cooperation with the family doctor and/or specialist palliative care team
ga: • I dtithe na ndaoine, is altraí cúram baile a oibríonn i gcomhar leis an dochtúir teaghlaigh agus / nó le sainfhoireann chúraim mhaolaithigh a chuireann an cúram ar fáil

source: • In hospices (dedicated specialist palliative care in-patient units)
ga: • In ospísí (sain-aonaid chúraim mhaolaithigh d’othair chónaitheacha)

source: • In general hospitals, by the hospital’s specialist palliative care team
ga: • In ospidéil ghinearálta ag foireann chúraim mhaolaithigh an ospidéil

source: • In community hospitals and nursing homes, by home-care nurses working in cooperation with the family doctor and/or specialist palliative care teams
ga: • In ospidéil phobail agus i dtithe altranais, is altraí cúram baile a oibríonn i gcomhar leis an dochtúir teaghlaigh agus / nó le sainfhoirne cúraim mhaolaithigh a chuireann an cúram ar fáil

source: Palliative care is provided by the HSE in partnership with voluntary service providers
ga: Soláthraíonn FSS cúram maolaitheach i gcomhar le soláthraithe seirbhíse deonacha

source: Both public and private patients can use the in-patient units and other services
ga: Is féidir le hothair phríobháideacha agus phoiblí aonaid na n-othar cónaitheach agus seirbhísí eile a úsáid

source: Palliative care and children
ga: Cúram maolaitheach agus leanaí

source: Palliative care for children is delivered differently from the palliative care services for adults
ga: Tá an chaoi a soláthraítear cúram maolaitheach do leanaí éagsúil ón gcaoi a soláthraítear do dhaoine fásta é

source: Many children requiring palliative care have life-limiting conditions, as opposed to advanced terminal conditions and children may survive for many years with these life-limiting conditions
ga: Bíonn riocht a chiorraíonn saol duine, seachas riocht forbartha foirceanta, ar roinnt mhaith leanaí a dteastaíonn cúram maolaitheach uathu, agus d’fhéadfadh leanaí maireachtáil ar feadh roinnt mhaith blianta agus riocht a chiorraíonn saol duine orthu

source: Where children need palliative care it is usually provided at home
ga: I gcás go mbíonn cúram maolaitheach de dhíth ar leanaí is iondúil go soláthraítear sa bhaile é

source: In the home, the family is supported by their family doctor, public health nurse and the specialist palliative care team (where available)
ga: Sa bhaile, faigheann an teaghlach tacaíocht óna ndochtúir teaghlaigh, ón altra sláinte poiblí agus ón sainfhoireann chúraim mhaolaithigh (má tá sí ar fáil)

source: The medical and nursing care of children in hospitals is the responsibility of paediatric-trained medical and nursing staff, with support from the specialist palliative care service. There is more information on palliative care for children on The Palliative Hub for Children and Young People
ga: Bíonn foireann mhíochaine agus altranais atá oilte sa phéidiatraic agus a bhfuil tacaíocht acu ó shainseirbhís cúraim mhaolaithigh freagrach as cúram altranais agus míochaine a thabhairt do leanaí atá san ospidéal

source: You can be referred for palliative care services in a number of ways; through your family doctor or through your hospital doctor in consultation with your family doctor or through the hospital’s specialist palliative care team in consultation with your family doctor
ga: Féadfar tú a atreorú chuig seirbhísí cúraim mhaolaithigh ar roinnt bealaí; trí do dhochtúir teaghlaigh nó trí do dhochtúir ospidéil i gcomhairle le do dhochtúir teaghlaigh nó trí shainfhoireann cúraim mhaolaithigh an ospidéil i gcomhairle le do dhochtúir teaghlaigh

source: You can talk to any of the above on your own initiative about getting a referral
ga: Is féidir leat labhairt le duine ar bith de na daoine thuasluaite ar do chonlán féin faoi atreorú a fháil

source: The HSE has responsibility for providing palliative care services; contact your Local Health Office
ga: Is dualgas é de chuid FSS seirbhísí cúraim mhaolaithigh a chur ar fáil; déan teagmháil le d’Oifig Sláinte Áitiúil

source: The Irish Hospice Foundation has a local services directory, giving all palliative care services, county by county
ga: Tá eolaire seirbhísí áitiúla ag Foras Ospíse na hÉireann ina dtugtar na seirbhísí cúraim mhaolaithigh ar fad, ar bhonn contae

source: This directory also gives contact details for local support groups for patients and their families
ga: Tá sonraí teagmhála do ghrúpaí tacaíochta áitiúla d’othair agus do theaghlaigh san eolaire freisin
